## 개미 전사는 부족한 식량을 충당하고자 메뚜기 마을의 식량창고를  공격할 예정
# 식량창고는 일직선으로 이어져있다.
# 각 식량창고에는 정해진 수의 식량을 저장하고 있으며 개미전사는 식량창고를 선택적으로 약탈하여 식량을 뺏을 예정
# 이때 메뚜기 정찰병들은 일직선상에 존재하는 식량창고 중에서 서로 인접한 식량창고가 공격받으면 바로 알아챌 수 있다.
# 따라서 개미 전사가 정찰병에게 들키지 않고 식량창고를 약탈하기 위해서는
# 최소한 한 칸 이상 떨어진 식량창고를 약탈해야한다.
# 예시: 1 3 1 5
# 이때 개미전사는 두번째와 네번째 식량창고를 선택했을 때 총 8개의 식량을 뺏을 수 있다.
# 개미전사를 위해 식량창고 n개에 대한 정보가 주어졌을 때 얻을 수 있는 식량의 최댓값을 구하는 프로그램을 작성하세요
#
# 입력조건: 첫째 줄에 식량창고 개수n이 주어진다.(3~100사이)
#           둘째 줄에 공백을 기준으로 식량창고에 저장된 식량의 개수 k가 주어진다.(0~1000)
# 출력조건: 첫째 줄에 개미 전사가 얻을 수 있는 식량의 최댓값을 출력하세요

